##1. Пользователь вводит с клавиатуры символ. Необходимо вывести на экран 
##количество раз, сколько этот символ встречается в кортеже в качестве элемента. 
##tuple1 = (2, 0, 3, 4, 0, "G", "A", "F", "L", "Q", "a", "a", "h", "o", "p", "w", "w", "x", "x", 5, 
##6, 10, 11, 7, 7, 8, 0, 15, 2, 3, 4, "r", "r", "r", "e", "e", "a")

##1.1. Посчитайте количество цифр в этом кортеже.
#print(len([tuple1[i] for i in range(len(tuple1)) if(str(tuple1[i]).isdigit())]))

#1.2. Посчитайте количество букв в этом кортеже.
#print(len([tuple1[i] for i in range(len(tuple1)) if(str(tuple1[i]).isalpha())]))

##1.3. Посчитайте количество Upper букв в этом кортеже.
##listvalue = [tuple1[i] for i in range(len(tuple1)) if(str(tuple1[i]).isalpha())]
##upper = list(filter(lambda i: i!="r" and i!="w" and i!="x" and i!="a" and i!="e" and i!="h" and i!="p" and i!="o" , listvalue))
##print(len(upper))

##2. Есть кортеж с целыми числами
##t_num = (2, 8, 10, 25, 1, 2, 771, 125, 256, 100, 8, 10, 81, 96, 8, 1, 144, 5)
##g = [t_num[i] for i in range(len(t_num)) if len(str(t_num[i]))==1]
##g2 = [t_num[i] for i in range(len(t_num)) if len(str(t_num[i]))==2]
##g3 = [t_num[i] for i in range(len(t_num)) if len(str(t_num[i]))==3]
##print("Одна цифра",len(g),"Две цифры",len(g2),"Три цифры",len(g3)) 

##3. Существует два множества
##Необходимо создать третье множество, содержащее названия, которые есть в 
##обоих множествах
##set1 = {"Комедия","Драма","Приключения","Вестерн","Ужас","Фантастика"}
##set2 = {"Боевик","Мелодрама","Вестерн","Ужас","Мистика","Комедия"}
##print(set1&set2)
##print(set1.intersection(set2))
##4
##Необходимо создать третье множество, содержащее названия, которые есть в 
##первом множестве, но нет во втором.
##5
##Необходимо создать третье множество, содержащее названия, которые есть во 
##втором множестве, но нет в первом.
##set1 = {"Комедия","Драма","Приключения","Вестерн","Ужас","Фантастика"}
##set2 = {"Боевик","Мелодрама","Вестерн","Ужас","Мистика","Комедия"}
##print(set1-set2)
##print(set1.difference(set2))
##6
##Необходимо создать третье множество, содержащее уникальные названия для 
##каждого множества.
##set1 = {"Комедия","Драма","Приключения","Вестерн","Ужас","Фантастика"}
##set2 = {"Боевик","Мелодрама","Вестерн","Ужас","Мистика","Комедия"}
##print(set2.symmetric_difference(set1))
