a = "Hornet"
##print(a[0])
##print(a[:-1]) убирает последние символы 
##print(a[2:])  #убирает первые символы если написать 1 то уберется нулевой символ если 2 то уберутся 0 1 символы
##print(a[::4]) задает шаг если  шаг 3 то будет считать 012 и уберет эти индексы
##print(a[::-1]) выведет текс задом на перед
##print(a[::-2]) #выводит символы задом на перед с шагом который мы зададим если -2 то выведет символ -2 сначала и со сдедующего символ отчет начинается с начала
##total: emrS показывает первую букву отчет с -1 ведется со 2 буквы если  не четное количество букв если четно -1 с первой буквы ведется
##print(a[1::2]) #cколько елементов и скаким шагом где второй отчет начинается с того индекса который был последний
##print(a[3::]) удаляет первые три элемента 0 1 2
