#dict{key:value}
dt_1={"p1":"Movie","p2":"Sci-Fi","p3":"Star wars","p4":2019,"p5":"Part7"}
##print(dt_1["p1"])           ##1 вариант
                                   ###обращаемся к ключу и выводится значение этого ключа
##print(dt_1.get("p1"))      ##2 вариант

##for i in dt_1:
##    print(dt_1.get(i),end=" ")                        #Можно и через цикл послание сделать
##Movie Sci-Fi Star wars 2019 Part7 

##for i in dt_1:
##    print(dt_1[i],end=" ")
####Movie Sci-Fi Star wars 2019 Part7 
##------------------------------------------------------------
##if "p2" in dt_1:
##    print("Yes")            #Проверяет есть ли парамент в этом словаре
##else:
##    print("No")
##Yes
##-------------------------------------------------------------------
##for i,j in dt_1.items():            #Через цикл for  мы можем пройтись по всему словарю
##    print("key",i,"value",j,end=" ")     
##p1 Movie
##p2 Sci-Fi
##p3 Star wars
##p4 2019
##p5 Part7
##-----------------------------------------------------------------------------
##print(dt_1)                  ##старый словарь
##dt_1["p4"]=2020     ##можно менять значение у ключа
##print(dt_1)                   ##словарь после изменения
##{'p1': 'Movie', 'p2': 'Sci-Fi', 'p3': 'Star wars', 'p4': 2019, 'p5': 'Part7'}
##{'p1': 'Movie', 'p2': 'Sci-Fi', 'p3': 'Star wars', 'p4': 2020, 'p5': 'Part7'}
##-----------------------------------------------------------------------------------
##print(dt_1)                  ##старый словарь
##dt_1["p6"]=100     ##можно добавлять ключ и значение
##print(dt_1)                   ##словарь после изменения
##{'p1': 'Movie', 'p2': 'Sci-Fi', 'p3': 'Star wars', 'p4': 2019, 'p5': 'Part7'}
##{'p1': 'Movie', 'p2': 'Sci-Fi', 'p3': 'Star wars', 'p4': 2019, 'p5': 'Part7', 'p6': 100}
##---------------------------------------------------------------------------------------------
##НАМ НУЖНО ИЗМЕНИТЬ НЕСКОЛЬКО ОБЬЕКТОВ В СЛОВАРЕ
##print(dt_1)
##dt_1.update((("p1","Nick"),("p2","Rober"),("p3","Mitya"),("p4","Bogdan"),("p5","Denis"))) # ввиде кортежа
##dt_1.update([("p1","Nick"),("p2","Rober"),("p3","Mitya"),("p4","Bogdan"),("p5","Denis")]) # ввиде списка
##print(dt_1)
##{'p1': 'Movie', 'p2': 'Sci-Fi', 'p3': 'Star wars', 'p4': 2019, 'p5': 'Part7'}
##{'p1': 'Nick', 'p2': 'Rober', 'p3': 'Mitya', 'p4': 'Bogdan', 'p5': 'Denis'}
##-----------------------------------------------------------------------------------------
##МОЖНО В ОДИН СЛОВАТЬ ДОБАВИТЬ ДРУГОЙ СЛОВАРЬ
##dt_1={"p1":"Movie","p2":"Sci-Fi","p3":"Star wars","p4":2019,"p5":"Part7"}
##dt_2={"p2":"Horror","p4":2017, "p6":"Usa"}
##dt_1.update(dt_2)
##print(dt_1)
####{'p1': 'Movie', 'p2': 'Horror', 'p3': 'Star wars', 'p4': 2017, 'p5': 'Part7', 'p6': 'Usa'}
##dt_2.update(dt_1)
##print(dt_2)
####{'p2': 'Horror', 'p4': 2017, 'p6': 'Usa', 'p1': 'Movie', 'p3': 'Star wars', 'p5': 'Part7'}
##----------------------------------------------------------------------------------------------
##МОЖНО УДАЛЯТЬ КЛЮЧ ИЗ СЛОВАРЯ   del
##dt_1={"p1":"Movie","p2":"Sci-Fi","p3":"Star wars","p4":2019,"p5":"Part7"}
##print(dt_1)
##del dt_1["p5"]
##print(dt_1)
##{'p1': 'Movie', 'p2': 'Sci-Fi', 'p3': 'Star wars', 'p4': 2019, 'p5': 'Part7'}
##{'p1': 'Movie', 'p2': 'Sci-Fi', 'p3': 'Star wars', 'p4': 2019}
##--------------------------------------------------------------------------------------------------
##МОЖНО ОЧИСТИТЬ ВЕСЬ СЛОВАРЬ
##dt_1.clear()
##print(dt_1)
##{}
##---------------------------------------------------------------------------------------------------------
##МОЖНО ВЫВЕСТИ КАКИЕ ЕСТЬ КЛЮЧИ   .keys()

##print(dt_1.keys())
##dict_keys(['p1', 'p2', 'p3', 'p4', 'p5'])          

##key_list = list(dt_1.keys())
##print(key_list)
##['p1', 'p2', 'p3', 'p4', 'p5']

##----------------------------------------------------------------------------------------------------
##МОЖНО ВЫВЕСТИ КАКИЕ ЕСТЬ ЗНАЧЕНИЯ  .values()

##print(dt_1.values())
##dict_values(['Movie', 'Sci-Fi', 'Star wars', 2019, 'Part7'])

##values_list = list(dt_1.values())
##print(values_list )
##['Movie', 'Sci-Fi', 'Star wars', 2019, 'Part7']

##-----------------------------------------------------------------------------------------------------------
#МОЖНО В ВИДЕ СПИСКА ВЫВЕСТИ ЗНАЧЕНИЯ И КЛЮЧИ В СКОБКАХ ЧЕРЕЗ КОМУ

##k_v_l = list(dt_1.items())
##print(k_v_l )
##[('p1', 'Movie'), ('p2', 'Sci-Fi'), ('p3', 'Star wars'), ('p4', 2019), ('p5', 'Part7')]

##-----------------------------------------------------------------------------------------------------------------
#МОЖНО УДАЛИТЬ КЛЮЧ И ЗНАЧИЕ ЧЕРЕЗ ИНДЕКС КЛЮЧА .pop()

##print(dt_1)
##dt_1.pop("p1")
##print(dt_1)

##{'p1': 'Movie', 'p2': 'Sci-Fi', 'p3': 'Star wars', 'p4': 2019, 'p5': 'Part7'}
##{'p2': 'Sci-Fi', 'p3': 'Star wars', 'p4': 2019, 'p5': 'Part7'}
##-----------------------------------------------------------------------------------------------
##МОЖНО СКОПИРОВАТЬ СЛОВАРЬ  .copy()
##dt_2 = dt_1.copy()
##print(dt_2)
##{'p1': 'Movie', 'p2': 'Sci-Fi', 'p3': 'Star wars', 'p4': 2019, 'p5': 'Part7'}
##------------------------------------------------------------------------------------------------
##МОЖНО СКОПИРОВАТЬ С НАЧАЛА СЛОВАРЬ А ПОТОМ ДОБАВИТЬ ДАННЫЕ К ПРИМЕРУ

dt_1={"p1":"Movie","p2":"Sci-Fi","p3":"Star wars","p4":2019,"p5":"Part7"}
##dt_2 = dt_1.copy()
##dt_2["p6"]="Roma"
##print(dt_2)

##{'p1': 'Movie', 'p2': 'Sci-Fi', 'p3': 'Star wars', 'p4': 2019, 'p5': 'Part7', 'p6': 'Roma'}
##--------------------------------------------------------------------------------------------------------
##dt_2 = dt_1
##dt_2["p6"]="Roma"
##print(dt_1)
##print(dt_2)
##
##{'p1': 'Movie', 'p2': 'Sci-Fi', 'p3': 'Star wars', 'p4': 2019, 'p5': 'Part7', 'p6': 'Roma'}
##{'p1': 'Movie', 'p2': 'Sci-Fi', 'p3': 'Star wars', 'p4': 2019, 'p5': 'Part7', 'p6': 'Roma'}
##ВЫВЕЛОСЬ ОДИНАКОВО ПОТОМУ ЧТО dt_2 = dt_1 ТО ЕСТЬ МЫ ИЗМЕНИЛИ СТАРЫЙ СЛОВАРЬ
##А НЕ СДЕЛАЛИ НОВЫЙ

##------------------------------------------------------------------------------------------------------------
users_list =[
{"name":"Jack","role":"admin","year":2010,"salery":120},
{"name":"Anna","role":"superadmin","year":2015,"salery":130},
{"name":"Mark","role":"user","year":2022,"salery":60},
{"name":"Dan","role":"view","year":2019,"salery":100}]

#salary > 80 Вывести тех у кого заплата больше 80-ти
us = list(filter(lambda i: i["salery"]>80,users_list))
print(us)
##[{'name': 'Jack', 'role': 'admin', 'year': 2010, 'salery': 120}, {'name': 'Anna', 'role': 'superadmin', 'year': 2015, 'salery': 130}, {'name': 'Dan', 'role': 'view', 'year': 2019, 'salery': 100}]
##-------------------------------------------------------------------
for a in us:
    for i,j in a.items():
        print("key:",i,"    ","values:", j)

